---
kind: method
id: M:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.GetEnumerator
source: html/7d71755f-e5c2-4684-b84c-803ed4945c7b.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.